In [1]:
# imports
import pandas as pd
import numpy as np

In [2]:
df_name_basics = pd.read_csv('data/name.basics.csv')

In [3]:
df_name_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12280097 entries, 0 to 12280096
Data columns (total 6 columns):
 #   Column             Dtype
---  ------             -----
 0   nconst             object
 1   primaryName        object
 2   birthYear          float64
 3   deathYear          float64
 4   primaryProfession  object
 5   knownForTitles     object
dtypes: float64(2), object(4)
memory usage: 562.1+ MB

In [4]:
df_name_basics.describe()

           birthYear      deathYear
count  570482.000000  211187.000000
mean     1952.279991    1991.843182
std        34.874081      34.688326
min         4.000000      17.000000
25%      1931.000000    1978.000000
50%      1959.000000    2000.000000
75%      1978.000000    2013.000000
max      2022.000000    2023.000000

In [5]:
df_name_basics['birthYear'] = df_name_basics['birthYear'].astype('Int64')

In [6]:
df_name_basics['deathYear'] = df_name_basics['deathYear'].astype('Int64')

In [7]:
df_name_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12280097 entries, 0 to 12280096
Data columns (total 6 columns):
 #   Column             Dtype
---  ------             -----
 0   nconst             object
 1   primaryName        object
 2   birthYear          Int64
 3   deathYear          Int64
 4   primaryProfession  object
 5   knownForTitles     object
dtypes: Int64(2), object(4)
memory usage: 585.6+ MB

In [8]:
df_name_basics.to_csv('data/name.basics.csv', index=False)

In [9]:
df_title_akas = pd.read_csv('data/title.akas.csv')

C:\Users\Dante\AppData\Local\Temp\ipykernel_17792\3761570095.py:1: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.
  df_title_akas = pd.read_csv('data/title.akas.csv')

In [10]:
df_title_akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34810677 entries, 0 to 34810676
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleId          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isOriginalTitle  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 2.1+ GB

In [11]:
df_title_akas.describe()

           ordering  isOriginalTitle
count  3.481068e+07     3.480857e+07
mean   4.130534e+00     5.179185e-02
std    3.892257e+00     2.216065e-01
min    1.000000e+00     0.000000e+00
25%    2.000000e+00     0.000000e+00
50%    4.000000e+00     0.000000e+00
75%    6.000000e+00     0.000000e+00
max    2.480000e+02     1.000000e+00

In [12]:
df_title_akas['isOriginalTitle'].unique()

array([ 0.,  1., nan])

In [13]:
df_title_akas['isOriginalTitle'] = df_title_akas['isOriginalTitle'].astype(
    'bool')

In [14]:
df_title_akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34810677 entries, 0 to 34810676
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleId          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isOriginalTitle  bool
dtypes: bool(1), int64(1), object(6)
memory usage: 1.8+ GB

In [15]:
df_title_akas.to_csv('data/title.akas.csv', index=False)

In [16]:
df_title_basics = pd.read_csv('data/title.basics.csv')

C:\Users\Dante\AppData\Local\Temp\ipykernel_17792\4271078385.py:1: DtypeWarning: Columns (7) have mixed types. Specify dtype option on import or set low_memory=False.
  df_title_basics = pd.read_csv('data/title.basics.csv')

In [17]:
# generate list of tconsts that need to be fixed
tconst_list = df_title_basics.loc[((df_title_basics['isAdult'] != 0) & (
    df_title_basics['isAdult'] != 1)), 'tconst'].to_list()

In [18]:
# fix data
for tconst in tconst_list:
    df_title_basics.loc[df_title_basics['tconst'] == tconst,
                        'genres'] = df_title_basics.loc[df_title_basics['tconst'] == tconst, 'runtimeMinutes']
    df_title_basics.loc[df_title_basics['tconst'] == tconst,
                        'runtimeMinutes'] = df_title_basics.loc[df_title_basics['tconst'] == tconst, 'endYear']
    df_title_basics.loc[df_title_basics['tconst'] == tconst,
                        'endYear'] = df_title_basics.loc[df_title_basics['tconst'] == tconst, 'startYear']
    df_title_basics.loc[df_title_basics['tconst'] == tconst,
                        'startYear'] = df_title_basics.loc[df_title_basics['tconst'] == tconst, 'isAdult']
    df_title_basics.loc[df_title_basics['tconst'] == tconst,
                        'isAdult'] = df_title_basics.loc[df_title_basics['tconst'] == tconst, 'originalTitle']
    df_title_basics.loc[df_title_basics['tconst'] == tconst,
                        'originalTitle'] = df_title_basics.loc[df_title_basics['tconst'] == tconst, 'primaryTitle']

In [19]:
# infer data types
df_title_basics = df_title_basics.infer_objects()

In [20]:
df_title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9588557 entries, 0 to 9588556
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       float64
 6   endYear         float64
 7   runtimeMinutes  object
 8   genres          object
dtypes: float64(2), object(7)
memory usage: 658.4+ MB

In [21]:
df_title_basics['runtimeMinutes'] = df_title_basics['runtimeMinutes'].astype(
    'float64')

In [22]:
df_title_basics['runtimeMinutes'] = df_title_basics['runtimeMinutes'].astype(
    'Int64')

In [23]:
df_title_basics['isAdult'] = df_title_basics['isAdult'].astype(
    'bool')

In [24]:
df_title_basics['startYear'] = df_title_basics['startYear'].astype(
    'Int64')

In [25]:
df_title_basics['endYear'] = df_title_basics['endYear'].astype(
    'Int64')

In [26]:
df_title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9588557 entries, 0 to 9588556
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         bool
 5   startYear       Int64
 6   endYear         Int64
 7   runtimeMinutes  Int64
 8   genres          object
dtypes: Int64(3), bool(1), object(5)
memory usage: 621.8+ MB

In [27]:
df_title_basics.to_csv('data/title.basics.csv', index=False)

In [28]:
df_title_crew = pd.read_csv('data/title.crew.csv')

In [29]:
df_title_crew.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9588557 entries, 0 to 9588556
Data columns (total 3 columns):
 #   Column     Dtype
---  ------     -----
 0   tconst     object
 1   directors  object
 2   writers    object
dtypes: object(3)
memory usage: 219.5+ MB

In [30]:
df_title_crew.describe()

           tconst  directors    writers
count     9588557    5502241    4946468
unique    9588557     855967    1240962
top     tt0000001  nm1203430  nm6352729
freq            1      11084      13150

In [31]:
df_title_episode = pd.read_csv('data/title.episode.csv')

In [32]:
df_title_episode.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7262087 entries, 0 to 7262086
Data columns (total 4 columns):
 #   Column         Dtype
---  ------         -----
 0   tconst         object
 1   parentTconst   object
 2   seasonNumber   float64
 3   episodeNumber  float64
dtypes: float64(2), object(2)
memory usage: 221.6+ MB

In [33]:
df_title_episode.describe()

       seasonNumber  episodeNumber
count  5.757612e+06   5.757612e+06
mean   3.739355e+00   3.979069e+02
std    2.320479e+01   1.307477e+03
min    1.000000e+00   0.000000e+00
25%    1.000000e+00   7.000000e+00
50%    1.000000e+00   2.600000e+01
75%    3.000000e+00   1.460000e+02
max    2.021000e+03   9.133400e+04

In [34]:
df_title_episode['seasonNumber'] = df_title_episode['seasonNumber'].astype(
    'Int64')

In [35]:
df_title_episode['episodeNumber'] = df_title_episode['episodeNumber'].astype(
    'Int64')

In [36]:
df_title_episode.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7262087 entries, 0 to 7262086
Data columns (total 4 columns):
 #   Column         Dtype
---  ------         -----
 0   tconst         object
 1   parentTconst   object
 2   seasonNumber   Int64
 3   episodeNumber  Int64
dtypes: Int64(2), object(2)
memory usage: 235.5+ MB

In [37]:
df_title_episode.head()

      tconst parentTconst  seasonNumber  episodeNumber
0  tt0041951    tt0041038             1              9
1  tt0042816    tt0989125             1             17
2  tt0042889    tt0989125          <NA>           <NA>
3  tt0043426    tt0040051             3             42
4  tt0043631    tt0989125             2             16

In [38]:
df_title_basics[df_title_basics['tconst'] == 'tt0041951']

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
41222,tt0041951,tvEpisode,The Tenderfeet,The Tenderfeet,False,1949,<NA>,30,Western

In [39]:
df_title_basics[df_title_basics['tconst'] == 'tt0041038']

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
40327,tt0041038,tvSeries,The Lone Ranger,The Lone Ranger,False,1949,1957,30,Western

In [40]:
df_title_episode[df_title_episode['parentTconst'] == 'tt0041038']

           tconst parentTconst  seasonNumber  episodeNumber
0       tt0041951    tt0041038             1              9
144358  tt0635319    tt0041038             4             13
144359  tt0635320    tt0041038             5             21
144360  tt0635321    tt0041038             1             41
144361  tt0635322    tt0041038             3             27
...           ...          ...           ...            ...
144573  tt0635535    tt0041038             1              6
144574  tt0635536    tt0041038             5              6
144575  tt0635537    tt0041038             1             44
144576  tt0635538    tt0041038             3             43
144577  tt0635539    tt0041038             3             12

[221 rows x 4 columns]

In [41]:
df_title_episode.to_csv('data/title.episode.csv', index=False)

In [42]:
df_title_principals = pd.read_csv('data/title.principals.csv')

In [43]:
df_title_principals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54449449 entries, 0 to 54449448
Data columns (total 6 columns):
 #   Column      Dtype
---  ------      -----
 0   tconst      object
 1   ordering    int64
 2   nconst      object
 3   category    object
 4   job         object
 5   characters  object
dtypes: int64(1), object(5)
memory usage: 2.4+ GB

In [44]:
df_title_principals.describe()

           ordering
count  5.444945e+07
mean   4.601127e+00
std    2.782244e+00
min    1.000000e+00
25%    2.000000e+00
50%    4.000000e+00
75%    7.000000e+00
max    1.000000e+01

In [45]:
df_title_principals.head()

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,NaN,"[""Self""]"
1,tt0000001,2,nm0005690,director,NaN,NaN
2,tt0000001,3,nm0374658,cinematographer,director of photography,NaN
3,tt0000002,1,nm0721526,director,NaN,NaN
4,tt0000002,2,nm1335271,composer,NaN,NaN

In [46]:
df_title_principals[df_title_principals['nconst'] == 'nm1588970']

             tconst  ordering     nconst         category  job characters
0         tt0000001         1  nm1588970             self  NaN   ["Self"]
47647083  tt7513040         2  nm1588970  archive_footage  NaN   ["Self"]

In [47]:
df_name_basics[df_name_basics['nconst'] == 'nm1588970']

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
5281800,nm1588970,Carmencita,1868,1910,soundtrack,"tt0000001,tt0057728"

In [48]:
df_title_ratings = pd.read_csv('data/title.ratings.csv')

In [49]:
df_title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1275548 entries, 0 to 1275547
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1275548 non-null  object
 1   averageRating  1275548 non-null  float64
 2   numVotes       1275548 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 29.2+ MB

In [50]:
df_title_ratings.describe()

       averageRating      numVotes
count   1.275548e+06  1.275548e+06
mean    6.948942e+00  1.042030e+03
std     1.386424e+00  1.736820e+04
min     1.000000e+00  5.000000e+00
25%     6.200000e+00  1.100000e+01
50%     7.100000e+00  2.600000e+01
75%     7.900000e+00  1.010000e+02
max     1.000000e+01  2.696221e+06